src/Documents/БольничныйЛист/БольничныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БольничныйЛист</name>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПредприятия</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <attributes>
    <name>ПоказательРасчета</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/AccumulationRegisters/УчетЗатрат/УчетЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетЗатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/КадроваяИсторияСотрудников/КадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасходыНаПродажу</name>
      <description>Расходы на продажу</description>
      <code>44</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчет с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчет с подотчетными лицами</description>
      <code>71</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

src/ChartsOfCalculationTypes/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Начисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
  </predefined>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/Documents/БольничныйЛист/ObjectModule.bsl
// Модуль объекта документа "БольничныйЛист".
// Содержит логику проведения больничного листа:
//   1. Расчёт пособия на основании оклада сотрудника (взятого из кадровой истории).
//   2. Формирование движений по регистру расчёта "Начисления" с разбивкой по месяцам
//      для корректного вытеснения других видов расчёта в разных периодах.
//   3. Принудительный расчёт сумм в регистре расчёта и последующее формирование
//      бухгалтерских проводок и записей в регистр "УчетЗатрат".

Процедура ОбработкаПроведения(Отказ, Режим)    
    Движения.Начисления.Записывать    = Истина;
    Движения.УчетЗатрат.Записывать    = Истина;
    Движения.Хозрасчетный.Записывать  = Истина;
    
    // Получение текущего оклада сотрудника на дату окончания больничного
    // из регистра сведений "КадроваяИсторияСотрудников".
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад
    |ИЗ
    |    РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
    Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаОкончания);
    Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Сотрудник);
    
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        ПараметрРасчета = 0;
    Иначе
        ПараметрРасчета = Запрос.Выполнить().Выгрузить()[0].Оклад;
    КонецЕсли;
    
    // Определяем начальные и конечные месяцы, чтобы разбить больничный
    // по расчётным периодам. Это необходимо, чтобы в регистре расчёта
    // записи о больничном корректно вытесняли другие начисления в каждом месяце.
    МесяцНачисления = НачалоМесяца(ЭтотОбъект.ДатаНачала);
    МесяцОкончания = НачалоМесяца(ЭтотОбъект.ДатаОкончания);
    
    Пока МесяцНачисления <= МесяцОкончания Цикл
        Движение = Движения.Начисления.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета             = ПланыВидовРасчета.Начисления.Больничный;
        // Период действия – пересечение периода больничного и текущего месяца.
        Движение.ПериодДействияНачало   = Макс(ЭтотОбъект.ДатаНачала, МесяцНачисления);
        Движение.ПериодДействияКонец    = Мин(ЭтотОбъект.ДатаОкончания, КонецМесяца(МесяцНачисления));
        Движение.ПериодРегистрации      = ЭтотОбъект.ПериодНачисления;
        Движение.БазовыйПериодНачало    = Макс(ЭтотОбъект.ДатаНачала, МесяцНачисления);
        Движение.БазовыйПериодКонец     = Мин(ЭтотОбъект.ДатаОкончания, КонецМесяца(МесяцНачисления));
        Движение.Сотрудник              = ЭтотОбъект.Сотрудник;
        Движение.ПоказательРасчета      = ПараметрРасчета;
        
        МесяцНачисления = ДобавитьМесяц(МесяцНачисления, 1);
    КонецЦикла;
    
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();
    
    // Запрос к уже записанным движениям для получения сумм и статей затрат.
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Начисления.Сотрудник КАК Сотрудник,
    |    СУММА(Начисления.Сумма) КАК Сумма,
    |    Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат
    |ИЗ
    |    РегистрРасчета.Начисления КАК Начисления
    |ГДЕ
    |    Начисления.Регистратор = &Регистратор
    |
    |СГРУППИРОВАТЬ ПО
    |    Начисления.Сотрудник,
    |    Начисления.ВидРасчета.СтатьяЗатрат";
    
    Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    
    // Движение в регистр "Учет затрат" (общая сумма по статье).
    ДвижениеЗатрат = Движения.УчетЗатрат.Добавить();
    ДвижениеЗатрат.Период        = Дата;
    ДвижениеЗатрат.Сумма         = Выборка.Сумма;
    ДвижениеЗатрат.СтатьяЗатрат  = Выборка.СтатьяЗатрат;    
    // Бухгалтерская проводка: Дт 44 Кт 70.
    ДвижениеХозрасчетный = Движения.Хозрасчетный.Добавить();
    ДвижениеХозрасчетный.СчетДт        = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;     
    ДвижениеХозрасчетный.СчетКт        = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
    ДвижениеХозрасчетный.Период        = Дата;        
    ДвижениеХозрасчетный.Сумма         = Выборка.Сумма;        
    ДвижениеХозрасчетный.Содержание    = "Отражено начисление по больничному листу";
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетДт, 
                    ДвижениеХозрасчетный.СубконтоДт, Выборка.СтатьяЗатрат);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетКт, 
                        ДвижениеХозрасчетный.СубконтоКт, Выборка.Сотрудник);
    
КонецПроцедуры
